import unittest
import main

class TDDtestGetRoots(unittest.TestCase):
	def testGetRoots(self):
		self.assertEqual(main.ftask1(), [('11Б (углубленный)', 'Петров'), ('11Б (углубленный)', 'Семенов'),
										 ('11Б (углубленный)', 'Николаев'), ('11Г (углубленный)', 'Яковлев'),
										 ('11Г (углубленный)', 'Менделеев')])
		self.assertEqual(main.ftask2(), [('11В', 3.0), ('11А', 4.2), ('11Г (углубленный)', 4.45),
										 ('11Б (углубленный)', 4.67), ('11Д', 4.8)])
		self.assertEqual(main.ftask3(), [('Алексеев', '11А'), ('Андреев', '11А'), ('Аксаков', '11В'),
										 ('Александров', '11Д'), ('Алексеев', '11Е'), ('Андреев', '11Е'),
										 ('Аксаков', '11З')])

if __name__ == "__main__":
	unittest.main()
